cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'd12frosted/emacs-plus'
tap 'garethr/kubeval'

# core packages
brew 'git'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'ack'
brew 'autoconf'
brew 'readline'
brew 'findutils', args: ['with-default-names']
brew 'libpng'
brew 'freetype'
brew 'openssl'
brew 'gnu-tar'
brew 'libtool'
brew 'htop-osx'
brew 'pkg-config'
brew 'jpeg'
brew 'libtiff'
brew 'imagemagick'
brew 'libevent'
brew 'qt5'
brew 'xz'
brew 'watch'
brew 'nmap'
brew 'wget'

# 3rd party cli utilities
brew 'jq'
brew 'adr-tools'
brew 'hub'
brew 'awscli'
brew 'terraform'
brew 'kubectl'
brew 'exercism'
brew 'openvpn'
brew 'kubeval'

# IDEs & editors
brew 'd12frosted/emacs-plus/emacs-plus', args: ['HEAD', 'with-natural-title-bars']
brew 'vim'
cask 'intellij-idea-ce'

brew 'tmux'
brew 'tmate'

# Languages & build tools
brew 'cmake'
brew 'ctags'

brew 'go'
brew 'gotags'

brew 'node'
brew 'nvm'

brew 'rbenv'
brew 'ruby-build'

cask 'java'
brew 'jenv'
brew 'maven'

brew 'python3'

brew 'clojure'
brew 'leiningen'

brew 'elixir'

# Databases
brew 'postgresql'

# Applications
cask 'iterm2'
cask 'ngrok'
cask 'virtualbox'

cask 'vagrant'
cask 'docker'

cask 'skype'
cask 'rawtherapee'
cask 'libreoffice'
cask 'google-chrome'
cask 'spectacle'
cask 'android-file-transfer'
cask 'flycut'
cask '1password6'
cask 'dropbox'
cask 'whatsapp'
cask 'caffeine'
cask 'spotify'
cask 'vlc'
cask 'steam'
cask 'postman'
cask 'keybase'
cask 'slack'
cask 'zoomus'
cask 'tunnelblick'
cask 'datagrip'
