cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'java'

brew 'ack'
brew 'autoconf'
brew 'awscli'
brew 'readline'
brew 'bash'
brew 'bash-completion'
brew 'chromedriver'
brew 'cmake'
brew 'xz'
brew 'coreutils'
brew 'ctags'
brew 'git'
brew 'go'
brew 'findutils', args: ['with-default-names']
brew 'libpng'
brew 'freetype'
brew 'openssl'
brew 'git-crypt'
brew 'gnu-tar'
brew 'gotags'
brew 'heroku-toolbelt'
brew 'libtool'
brew 'htop-osx'
brew 'pkg-config'
brew 'jpeg'
brew 'libtiff'
brew 'imagemagick'
brew 'libevent'
brew 'maven'
brew 'mercurial'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'packer'
brew 'postgresql'
brew 'qt5'
brew 'ruby-build'
brew 'rbenv'
brew 'tmux'
brew 'vim'
brew 's3cmd'
brew 'tmate'
brew 'kubernetes-cli'
brew 'watch'

cask 'virtualbox'
cask 'vagrant'
cask 'iterm2'
cask 'ngrok'
cask 'skype'
cask 'rawtherapee'
cask 'libreoffice'
cask 'google-cloud-sdk'
cask 'google-chrome'
cask 'spectacle'
cask 'firefoxdeveloperedition'
cask 'flycut'
cask '1password'
cask 'dropbox'
cask 'docker-toolbox'
cask 'whatsapp'
