cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'dbt-labs/dbt'
tap 'remind101/formulae'
tap 'hashicorp/tap'

# core packages
brew 'git'
brew 'bash'
brew 'bash-completion'
brew 'fish'
brew 'coreutils'
brew 'rg'
brew 'ack'
brew 'autoconf'
brew 'readline'
brew 'findutils'
brew 'libpng'
brew 'freetype'
brew 'openssl'
brew 'gnu-tar'
brew 'libtool'
brew 'htop-osx'
brew 'pkg-config'
brew 'jpeg'
brew 'libtiff'
brew 'imagemagick'
brew 'libevent'
brew 'qt5'
brew 'xz'
brew 'watch'
brew 'nmap'
brew 'wget'
# required for fish- https://github.com/franciscolourenco/done
brew 'terminal-notifier'

# 3rd party cli utilities
brew 'jq'
brew 'adr-tools'
brew 'hub'
brew 'awscli'
brew 'remind101/formulae/assume-role'
cask 'google-cloud-sdk'
brew 'terraform'
brew 'kubectl'
brew 'exercism'
brew 'openvpn'
brew 'kustomize'
brew 'hashicorp/tap/vault'

# IDEs & editors
brew 'vim'
cask 'emacs'
cask 'intellij-idea-ce'
cask 'datagrip'
cask 'visual-studio-code'

brew 'tmux'
brew 'tmate'

# Languages & build tools
brew 'cmake'
brew 'ctags'

brew 'go'
brew 'gotags'

brew 'node'

brew 'rbenv'
brew 'ruby-build'

brew 'jenv'
brew 'maven'

brew 'python3'
brew 'poetry'

brew 'clojure'
brew 'leiningen'

brew 'elixir'

# Databases
brew 'postgresql'

# Data Science
brew 'dbt-bigquery'
cask 'anaconda'

# kube UI
brew 'octant'

# Applications
cask 'iterm2'
cask 'ngrok'
cask 'virtualbox'

cask 'vagrant'
cask 'docker'
# Dockle - Container Image Linter for Security, Helping build the Best-Practice Docker Image, Easy to start
brew 'goodwithtech/r/dockle'

cask 'skype'
cask 'brave-browser'
cask 'spectacle'
cask 'android-file-transfer'
cask 'flycut'
cask '1password'
cask 'dropbox'
cask 'signal'
cask 'caffeine'
cask 'spotify'
cask 'vlc'
cask 'insomnia'
cask 'keybase'
cask 'slack'
cask 'zoom'
cask 'openoffice'
cask 'notion'
